shanlingjiangjie/damiao4310_driver/step1_run/Drivers/CSP/UART_STM32F4xx.h
/**
 * @file    UART_STM32F4xx.h
 * @author  Deadline039
 * @brief   Chip Support Package of UART on STM32F4xx
 * @version 1.0
 * @date    2025-02-27
 * @note    Generate Automatically.
 */

#ifndef __UART_STM32F4xx_H
#define __UART_STM32F4xx_H

#include <stdarg.h>

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/*****************************************************************************
 * @defgroup UART Public Marco. 
 * @{
 */

#define UART_INIT_OK         0
#define UART_INIT_FAIL       1
#define UART_INIT_DMA_FAIL   2
#define UART_INIT_MEM_FAIL   3
#define UART_INITED          4

#define UART_DEINIT_OK       0
#define UART_DEINIT_FAIL     1
#define UART_DEINIT_DMA_FAIL 2
#define UART_NO_INIT         3

/**
 * @}
 */

/* clang-format off */


/*****************************************************************************
 * @defgroup USART1 Functions
 * @{
 */

#if USART1_ENABLE

#if (USART1_TX_ID == 0)
#elif (USART1_TX_ID == 1)
#  define USART1_TX_AF GPIO_AF7_USART1
#elif (USART1_TX_ID == 2)
#  define USART1_TX_AF GPIO_AF7_USART1
#elif (USART1_TX_ID == 3)
#  define USART1_TX_AF GPIO_AF7_USART1
#  if !(defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F412Vx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F412Cx) || defined(STM32F413xx) || defined(STM32F423xx) || defined(STM32F412Rx) || defined(STM32F412Zx))
#    error "PA15 only can be configured as USART1 TX on STM32F411xE, STM32F410Cx, STM32F412Vx, STM32F410Rx, STM32F410Tx, STM32F412Cx, STM32F413xx, STM32F423xx, STM32F412Rx, STM32F412Zx! "
#  endif  /* !(defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F412Vx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F412Cx) || defined(STM32F413xx) || defined(STM32F423xx) || defined(STM32F412Rx) || defined(STM32F412Zx)) */
#endif  /* USART1_TX_ID */

#if (USART1_RX_ID == 0)
#elif (USART1_RX_ID == 1)
#  define USART1_RX_AF GPIO_AF7_USART1
#elif (USART1_RX_ID == 2)
#  define USART1_RX_AF GPIO_AF7_USART1
#elif (USART1_RX_ID == 3)
#  define USART1_RX_AF GPIO_AF7_USART1
#  if !(defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F412Vx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F412Cx) || defined(STM32F413xx) || defined(STM32F423xx) || defined(STM32F412Rx) || defined(STM32F412Zx))
#    error "PB3 only can be configured as USART1 RX on STM32F411xE, STM32F410Cx, STM32F412Vx, STM32F410Rx, STM32F410Tx, STM32F412Cx, STM32F413xx, STM32F423xx, STM32F412Rx, STM32F412Zx! "
#  endif  /* !(defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F412Vx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F412Cx) || defined(STM32F413xx) || defined(STM32F423xx) || defined(STM32F412Rx) || defined(STM32F412Zx)) */
#endif  /* USART1_RX_ID */

#if (USART1_CTS_ID == 0)
#elif (USART1_CTS_ID == 1)
#  define USART1_CTS_AF GPIO_AF7_USART1
#endif  /* USART1_CTS_ID */

#if (USART1_RTS_ID == 0)
#elif (USART1_RTS_ID == 1)
#  define USART1_RTS_AF GPIO_AF7_USART1
#endif  /* USART1_RTS_ID */

extern UART_HandleTypeDef usart1_handle;

uint8_t usart1_init(uint32_t baud_rate);
uint8_t usart1_deinit(void); 

#  if USART1_RX_DMA
#    define USART1_RX_DMA_IRQn                                                  \
      CSP_DMA_STREAM_IRQn(USART1_RX_DMA_NUMBER, USART1_RX_DMA_STREAM)
#    define USART1_RX_DMA_IRQHandler                                             \
      CSP_DMA_STREAM_IRQ(USART1_RX_DMA_NUMBER, USART1_RX_DMA_STREAM)
#  endif /* USART1_RX_DMA */

#  if USART1_TX_DMA
#    define USART1_TX_DMA_IRQn                                                  \
      CSP_DMA_STREAM_IRQn(USART1_TX_DMA_NUMBER, USART1_TX_DMA_STREAM)
#    define USART1_TX_DMA_IRQHandler                                             \
      CSP_DMA_STREAM_IRQ(USART1_TX_DMA_NUMBER, USART1_TX_DMA_STREAM)
#  endif /* USART1_TX_DMA */

#endif /* USART1_ENABLE */

/**
 * @}
 */

/*****************************************************************************
 * @defgroup USART2 Functions
 * @{
 */

#if USART2_ENABLE

#if (USART2_TX_ID == 0)
#elif (USART2_TX_ID == 1)
#  define USART2_TX_AF GPIO_AF7_USART2
#elif (USART2_TX_ID == 2)
#  define USART2_TX_AF GPIO_AF7_USART2
#  if (defined(STM32F410Cx) || defined(STM32F410Tx) || defined(STM32F410Rx))
#    error "PD5 can not be configured as USART2 TX on STM32F410Cx, STM32F410Tx, STM32F410Rx! "
#  endif  /* (defined(STM32F410Cx) || defined(STM32F410Tx) || defined(STM32F410Rx)) */
#endif  /* USART2_TX_ID */

#if (USART2_RX_ID == 0)
#elif (USART2_RX_ID == 1)
#  define USART2_RX_AF GPIO_AF7_USART2
#elif (USART2_RX_ID == 2)
#  define USART2_RX_AF GPIO_AF7_USART2
#  if (defined(STM32F410Cx) || defined(STM32F410Tx) || defined(STM32F410Rx))
#    error "PD6 can not be configured as USART2 RX on STM32F410Cx, STM32F410Tx, STM32F410Rx! "
#  endif  /* (defined(STM32F410Cx) || defined(STM32F410Tx) || defined(STM32F410Rx)) */
#endif  /* USART2_RX_ID */

#if (USART2_CTS_ID == 0)
#elif (USART2_CTS_ID == 1)
#  define USART2_CTS_AF GPIO_AF7_USART2
#elif (USART2_CTS_ID == 2)
#  define USART2_CTS_AF GPIO_AF7_USART2
#  if (defined(STM32F410Cx) || defined(STM32F410Tx) || defined(STM32F410Rx))
#    error "PD3 can not be configured as USART2 CTS on STM32F410Cx, STM32F410Tx, STM32F410Rx! "
#  endif  /* (defined(STM32F410Cx) || defined(STM32F410Tx) || defined(STM32F410Rx)) */
#endif  /* USART2_CTS_ID */

#if (USART2_RTS_ID == 0)
#elif (USART2_RTS_ID == 1)
#  define USART2_RTS_AF GPIO_AF7_USART2
#elif (USART2_RTS_ID == 2)
#  define USART2_RTS_AF GPIO_AF7_USART2
#  if (defined(STM32F410Cx) || defined(STM32F410Tx) || defined(STM32F410Rx))
#    error "PD4 can not be configured as USART2 RTS on STM32F410Cx, STM32F410Tx, STM32F410Rx! "
#  endif  /* (defined(STM32F410Cx) || defined(STM32F410Tx) || defined(STM32F410Rx)) */
#endif  /* USART2_RTS_ID */

extern UART_HandleTypeDef usart2_handle;

uint8_t usart2_init(uint32_t baud_rate);
uint8_t usart2_deinit(void); 

#  if USART2_RX_DMA
#    if (USART2_RX_DMA_NUMBER == 1) && (USART2_RX_DMA_STREAM == 7) && (USART2_RX_DMA_CHANNEL == 6)

#     if !(defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F412Vx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F412Cx) || defined(STM32F413xx) || defined(STM32F423xx) || defined(STM32F412Rx) || defined(STM32F412Zx))
#       error "This USART2 DMA RX configuration only valid on STM32F411xE, STM32F410Cx, STM32F412Vx, STM32F410Rx, STM32F410Tx, STM32F412Cx, STM32F413xx, STM32F423xx, STM32F412Rx, STM32F412Zx! "
#     endif  /* !(defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F412Vx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F412Cx) || defined(STM32F413xx) || defined(STM32F423xx) || defined(STM32F412Rx) || defined(STM32F412Zx)) */
#    endif /* (USART2_RX_DMA_NUMBER == 1) && (USART2_RX_DMA_STREAM == 7) && (USART2_RX_DMA_CHANNEL == 6) */

#    define USART2_RX_DMA_IRQn                                                  \
      CSP_DMA_STREAM_IRQn(USART2_RX_DMA_NUMBER, USART2_RX_DMA_STREAM)
#    define USART2_RX_DMA_IRQHandler                                             \
      CSP_DMA_STREAM_IRQ(USART2_RX_DMA_NUMBER, USART2_RX_DMA_STREAM)
#  endif /* USART2_RX_DMA */

#  if USART2_TX_DMA
#    define USART2_TX_DMA_IRQn                                                  \
      CSP_DMA_STREAM_IRQn(USART2_TX_DMA_NUMBER, USART2_TX_DMA_STREAM)
#    define USART2_TX_DMA_IRQHandler                                             \
      CSP_DMA_STREAM_IRQ(USART2_TX_DMA_NUMBER, USART2_TX_DMA_STREAM)
#  endif /* USART2_TX_DMA */

#endif /* USART2_ENABLE */

/**
 * @}
 */

/*****************************************************************************
 * @defgroup USART3 Functions
 * @{
 */

#if USART3_ENABLE

#if (USART3_TX_ID == 0)
#elif (USART3_TX_ID == 1)
#  define USART3_TX_AF GPIO_AF7_USART3
#elif (USART3_TX_ID == 2)
#  define USART3_TX_AF GPIO_AF7_USART3
#elif (USART3_TX_ID == 3)
#  define USART3_TX_AF GPIO_AF7_USART3
#endif  /* USART3_TX_ID */

