shanlingjiangjie/damiao4310_driver/step1_run/Drivers/CSP/UART_STM32F4xx.h
#if (USART3_RX_ID == 0)
#elif (USART3_RX_ID == 1)
#  define USART3_RX_AF GPIO_AF7_USART3
#elif (USART3_RX_ID == 2)
#  define USART3_RX_AF GPIO_AF7_USART3
#  if (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx))
#    error "PC5 can not be configured as USART3 RX on STM32F407xx, STM32F439xx, STM32F429xx, STM32F479xx, STM32F415xx, STM32F469xx, STM32F437xx, STM32F427xx, STM32F417xx, STM32F405xx! "
#  endif  /* (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx)) */
#elif (USART3_RX_ID == 3)
#  define USART3_RX_AF GPIO_AF7_USART3
#elif (USART3_RX_ID == 4)
#  define USART3_RX_AF GPIO_AF7_USART3
#endif  /* USART3_RX_ID */

#if (USART3_CTS_ID == 0)
#elif (USART3_CTS_ID == 1)
#  define USART3_CTS_AF GPIO_AF8_USART3
#elif (USART3_CTS_ID == 2)
#  define USART3_CTS_AF GPIO_AF7_USART3
#endif  /* USART3_CTS_ID */

#if (USART3_RTS_ID == 0)
#elif (USART3_RTS_ID == 1)
#  define USART3_RTS_AF GPIO_AF7_USART3
#elif (USART3_RTS_ID == 2)
#  define USART3_RTS_AF GPIO_AF7_USART3
#endif  /* USART3_RTS_ID */

extern UART_HandleTypeDef usart3_handle;

uint8_t usart3_init(uint32_t baud_rate);
uint8_t usart3_deinit(void); 

#  if USART3_RX_DMA
#    define USART3_RX_DMA_IRQn                                                  \
      CSP_DMA_STREAM_IRQn(USART3_RX_DMA_NUMBER, USART3_RX_DMA_STREAM)
#    define USART3_RX_DMA_IRQHandler                                             \
      CSP_DMA_STREAM_IRQ(USART3_RX_DMA_NUMBER, USART3_RX_DMA_STREAM)
#  endif /* USART3_RX_DMA */

#  if USART3_TX_DMA
#    define USART3_TX_DMA_IRQn                                                  \
      CSP_DMA_STREAM_IRQn(USART3_TX_DMA_NUMBER, USART3_TX_DMA_STREAM)
#    define USART3_TX_DMA_IRQHandler                                             \
      CSP_DMA_STREAM_IRQ(USART3_TX_DMA_NUMBER, USART3_TX_DMA_STREAM)
#  endif /* USART3_TX_DMA */

#endif /* USART3_ENABLE */

/**
 * @}
 */

/*****************************************************************************
 * @defgroup UART4 Functions
 * @{
 */

#if UART4_ENABLE

#if (UART4_TX_ID == 0)
#elif (UART4_TX_ID == 1)
#  define UART4_TX_AF GPIO_AF8_UART4
#elif (UART4_TX_ID == 2)
#  define UART4_TX_AF GPIO_AF11_UART4
#  if (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx))
#    error "PA12 can not be configured as UART4 TX on STM32F407xx, STM32F439xx, STM32F429xx, STM32F479xx, STM32F415xx, STM32F469xx, STM32F437xx, STM32F446xx, STM32F427xx, STM32F417xx, STM32F405xx! "
#  endif  /* (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx)) */
#elif (UART4_TX_ID == 3)
#  define UART4_TX_AF GPIO_AF11_UART4
#  if (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx))
#    error "PD1 can not be configured as UART4 TX on STM32F407xx, STM32F439xx, STM32F429xx, STM32F479xx, STM32F415xx, STM32F469xx, STM32F437xx, STM32F446xx, STM32F427xx, STM32F417xx, STM32F405xx! "
#  endif  /* (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx)) */
#elif (UART4_TX_ID == 4)
#  define UART4_TX_AF GPIO_AF8_UART4
#  if (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx))
#    error "PD10 can not be configured as UART4 TX on STM32F407xx, STM32F439xx, STM32F429xx, STM32F479xx, STM32F415xx, STM32F469xx, STM32F437xx, STM32F446xx, STM32F427xx, STM32F417xx, STM32F405xx! "
#  endif  /* (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx)) */
#elif (UART4_TX_ID == 5)
#  define UART4_TX_AF GPIO_AF8_UART4
#  if (defined(STM32F423xx) || defined(STM32F413xx))
#    error "PC10 can not be configured as UART4 TX on STM32F423xx, STM32F413xx! "
#  endif  /* (defined(STM32F423xx) || defined(STM32F413xx)) */
#endif  /* UART4_TX_ID */

#if (UART4_RX_ID == 0)
#elif (UART4_RX_ID == 1)
#  define UART4_RX_AF GPIO_AF8_UART4
#elif (UART4_RX_ID == 2)
#  define UART4_RX_AF GPIO_AF11_UART4
#  if (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx))
#    error "PA11 can not be configured as UART4 RX on STM32F407xx, STM32F439xx, STM32F429xx, STM32F479xx, STM32F415xx, STM32F469xx, STM32F437xx, STM32F446xx, STM32F427xx, STM32F417xx, STM32F405xx! "
#  endif  /* (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx)) */
#elif (UART4_RX_ID == 3)
#  define UART4_RX_AF GPIO_AF8_UART4
#elif (UART4_RX_ID == 4)
#  define UART4_RX_AF GPIO_AF11_UART4
#  if (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx))
#    error "PD0 can not be configured as UART4 RX on STM32F407xx, STM32F439xx, STM32F429xx, STM32F479xx, STM32F415xx, STM32F469xx, STM32F437xx, STM32F446xx, STM32F427xx, STM32F417xx, STM32F405xx! "
#  endif  /* (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx)) */
#endif  /* UART4_RX_ID */

#if (UART4_CTS_ID == 0)
#elif (UART4_CTS_ID == 1)
#  define UART4_CTS_AF GPIO_AF8_UART4
#  if !(defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F412Vx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC) || defined(STM32F412Cx) || defined(STM32F446xx) || defined(STM32F412Rx) || defined(STM32F412Zx))
#    error "PB0 only can be configured as UART4 CTS on STM32F401xE, STM32F411xE, STM32F410Cx, STM32F412Vx, STM32F410Rx, STM32F410Tx, STM32F401xC, STM32F412Cx, STM32F446xx, STM32F412Rx, STM32F412Zx! "
#  endif  /* !(defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F412Vx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC) || defined(STM32F412Cx) || defined(STM32F446xx) || defined(STM32F412Rx) || defined(STM32F412Zx)) */
#endif  /* UART4_CTS_ID */

#if (UART4_RTS_ID == 0)
#elif (UART4_RTS_ID == 1)
#  define UART4_RTS_AF GPIO_AF8_UART4
#  if !(defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F412Vx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC) || defined(STM32F412Cx) || defined(STM32F446xx) || defined(STM32F412Rx) || defined(STM32F412Zx))
#    error "PA15 only can be configured as UART4 RTS on STM32F401xE, STM32F411xE, STM32F410Cx, STM32F412Vx, STM32F410Rx, STM32F410Tx, STM32F401xC, STM32F412Cx, STM32F446xx, STM32F412Rx, STM32F412Zx! "
#  endif  /* !(defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F412Vx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC) || defined(STM32F412Cx) || defined(STM32F446xx) || defined(STM32F412Rx) || defined(STM32F412Zx)) */
#endif  /* UART4_RTS_ID */

extern UART_HandleTypeDef uart4_handle;

