shanlingjiangjie/damiao4310_driver/step1_run/Drivers/CSP/UART_STM32F4xx.h
uint8_t uart4_init(uint32_t baud_rate);
uint8_t uart4_deinit(void); 

#  if UART4_RX_DMA
#    define UART4_RX_DMA_IRQn                                                  \
      CSP_DMA_STREAM_IRQn(UART4_RX_DMA_NUMBER, UART4_RX_DMA_STREAM)
#    define UART4_RX_DMA_IRQHandler                                             \
      CSP_DMA_STREAM_IRQ(UART4_RX_DMA_NUMBER, UART4_RX_DMA_STREAM)
#  endif /* UART4_RX_DMA */

#  if UART4_TX_DMA
#    define UART4_TX_DMA_IRQn                                                  \
      CSP_DMA_STREAM_IRQn(UART4_TX_DMA_NUMBER, UART4_TX_DMA_STREAM)
#    define UART4_TX_DMA_IRQHandler                                             \
      CSP_DMA_STREAM_IRQ(UART4_TX_DMA_NUMBER, UART4_TX_DMA_STREAM)
#  endif /* UART4_TX_DMA */

#endif /* UART4_ENABLE */

/**
 * @}
 */

/*****************************************************************************
 * @defgroup UART5 Functions
 * @{
 */

#if UART5_ENABLE

#if (UART5_TX_ID == 0)
#elif (UART5_TX_ID == 1)
#  define UART5_TX_AF GPIO_AF11_UART5
#  if (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx))
#    error "PB6 can not be configured as UART5 TX on STM32F407xx, STM32F439xx, STM32F429xx, STM32F479xx, STM32F415xx, STM32F469xx, STM32F437xx, STM32F446xx, STM32F427xx, STM32F417xx, STM32F405xx! "
#  endif  /* (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx)) */
#elif (UART5_TX_ID == 2)
#  define UART5_TX_AF GPIO_AF11_UART5
#  if (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx))
#    error "PB9 can not be configured as UART5 TX on STM32F407xx, STM32F439xx, STM32F429xx, STM32F479xx, STM32F415xx, STM32F469xx, STM32F437xx, STM32F446xx, STM32F427xx, STM32F417xx, STM32F405xx! "
#  endif  /* (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx)) */
#elif (UART5_TX_ID == 3)
#  define UART5_TX_AF GPIO_AF11_UART5
#  if (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx))
#    error "PB13 can not be configured as UART5 TX on STM32F407xx, STM32F439xx, STM32F429xx, STM32F479xx, STM32F415xx, STM32F469xx, STM32F437xx, STM32F446xx, STM32F427xx, STM32F417xx, STM32F405xx! "
#  endif  /* (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx)) */
#elif (UART5_TX_ID == 4)
#  define UART5_TX_AF GPIO_AF8_UART5
#elif (UART5_TX_ID == 5)
#  define UART5_TX_AF GPIO_AF8_UART5
#  if !(defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F412Vx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC) || defined(STM32F412Cx) || defined(STM32F446xx) || defined(STM32F412Rx) || defined(STM32F412Zx))
#    error "PE8 only can be configured as UART5 TX on STM32F401xE, STM32F411xE, STM32F410Cx, STM32F412Vx, STM32F410Rx, STM32F410Tx, STM32F401xC, STM32F412Cx, STM32F446xx, STM32F412Rx, STM32F412Zx! "
#  endif  /* !(defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F412Vx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC) || defined(STM32F412Cx) || defined(STM32F446xx) || defined(STM32F412Rx) || defined(STM32F412Zx)) */
#endif  /* UART5_TX_ID */

#if (UART5_RX_ID == 0)
#elif (UART5_RX_ID == 1)
#  define UART5_RX_AF GPIO_AF11_UART5
#  if (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx))
#    error "PB5 can not be configured as UART5 RX on STM32F407xx, STM32F439xx, STM32F429xx, STM32F479xx, STM32F415xx, STM32F469xx, STM32F437xx, STM32F446xx, STM32F427xx, STM32F417xx, STM32F405xx! "
#  endif  /* (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx)) */
#elif (UART5_RX_ID == 2)
#  define UART5_RX_AF GPIO_AF11_UART5
#  if (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx))
#    error "PB8 can not be configured as UART5 RX on STM32F407xx, STM32F439xx, STM32F429xx, STM32F479xx, STM32F415xx, STM32F469xx, STM32F437xx, STM32F446xx, STM32F427xx, STM32F417xx, STM32F405xx! "
#  endif  /* (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx)) */
#elif (UART5_RX_ID == 3)
#  define UART5_RX_AF GPIO_AF11_UART5
#  if (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx))
#    error "PB12 can not be configured as UART5 RX on STM32F407xx, STM32F439xx, STM32F429xx, STM32F479xx, STM32F415xx, STM32F469xx, STM32F437xx, STM32F446xx, STM32F427xx, STM32F417xx, STM32F405xx! "
#  endif  /* (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx)) */
#elif (UART5_RX_ID == 4)
#  define UART5_RX_AF GPIO_AF8_UART5
#elif (UART5_RX_ID == 5)
#  define UART5_RX_AF GPIO_AF8_UART5
#  if !(defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F412Vx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC) || defined(STM32F412Cx) || defined(STM32F446xx) || defined(STM32F412Rx) || defined(STM32F412Zx))
#    error "PE7 only can be configured as UART5 RX on STM32F401xE, STM32F411xE, STM32F410Cx, STM32F412Vx, STM32F410Rx, STM32F410Tx, STM32F401xC, STM32F412Cx, STM32F446xx, STM32F412Rx, STM32F412Zx! "
#  endif  /* !(defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F412Vx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC) || defined(STM32F412Cx) || defined(STM32F446xx) || defined(STM32F412Rx) || defined(STM32F412Zx)) */
#endif  /* UART5_RX_ID */

#if (UART5_CTS_ID == 0)
#elif (UART5_CTS_ID == 1)
#  define UART5_CTS_AF GPIO_AF7_UART5
#  if !(defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F412Vx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC) || defined(STM32F412Cx) || defined(STM32F446xx) || defined(STM32F412Rx) || defined(STM32F412Zx))
#    error "PC9 only can be configured as UART5 CTS on STM32F401xE, STM32F411xE, STM32F410Cx, STM32F412Vx, STM32F410Rx, STM32F410Tx, STM32F401xC, STM32F412Cx, STM32F446xx, STM32F412Rx, STM32F412Zx! "
#  endif  /* !(defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F412Vx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC) || defined(STM32F412Cx) || defined(STM32F446xx) || defined(STM32F412Rx) || defined(STM32F412Zx)) */
#endif  /* UART5_CTS_ID */

