shanlingjiangjie/damiao4310_driver/step1_run/Drivers/CSP/UART_STM32F4xx.h
#if (UART5_RTS_ID == 0)
#elif (UART5_RTS_ID == 1)
#  define UART5_RTS_AF GPIO_AF7_UART5
#  if !(defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F412Vx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC) || defined(STM32F412Cx) || defined(STM32F446xx) || defined(STM32F412Rx) || defined(STM32F412Zx))
#    error "PC8 only can be configured as UART5 RTS on STM32F401xE, STM32F411xE, STM32F410Cx, STM32F412Vx, STM32F410Rx, STM32F410Tx, STM32F401xC, STM32F412Cx, STM32F446xx, STM32F412Rx, STM32F412Zx! "
#  endif  /* !(defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F412Vx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC) || defined(STM32F412Cx) || defined(STM32F446xx) || defined(STM32F412Rx) || defined(STM32F412Zx)) */
#endif  /* UART5_RTS_ID */

extern UART_HandleTypeDef uart5_handle;

uint8_t uart5_init(uint32_t baud_rate);
uint8_t uart5_deinit(void); 

#  if UART5_RX_DMA
#    define UART5_RX_DMA_IRQn                                                  \
      CSP_DMA_STREAM_IRQn(UART5_RX_DMA_NUMBER, UART5_RX_DMA_STREAM)
#    define UART5_RX_DMA_IRQHandler                                             \
      CSP_DMA_STREAM_IRQ(UART5_RX_DMA_NUMBER, UART5_RX_DMA_STREAM)
#  endif /* UART5_RX_DMA */

#  if UART5_TX_DMA
#    if (UART5_TX_DMA_NUMBER == 1) && (UART5_TX_DMA_STREAM == 7) && (UART5_TX_DMA_CHANNEL == 8)

#     if (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx))
#       error "This UART5 DMA TX configuration invalid on STM32F407xx, STM32F439xx, STM32F429xx, STM32F479xx, STM32F415xx, STM32F469xx, STM32F437xx, STM32F446xx, STM32F427xx, STM32F417xx, STM32F405xx! "
#     endif  /* (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F446xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F405xx)) */
#    endif /* (UART5_TX_DMA_NUMBER == 1) && (UART5_TX_DMA_STREAM == 7) && (UART5_TX_DMA_CHANNEL == 8) */

#    if (UART5_TX_DMA_NUMBER == 1) && (UART5_TX_DMA_STREAM == 7) && (UART5_TX_DMA_CHANNEL == 4)

#     if (defined(STM32F423xx) || defined(STM32F413xx))
#       error "This UART5 DMA TX configuration invalid on STM32F423xx, STM32F413xx! "
#     endif  /* (defined(STM32F423xx) || defined(STM32F413xx)) */
#    endif /* (UART5_TX_DMA_NUMBER == 1) && (UART5_TX_DMA_STREAM == 7) && (UART5_TX_DMA_CHANNEL == 4) */

#    define UART5_TX_DMA_IRQn                                                  \
      CSP_DMA_STREAM_IRQn(UART5_TX_DMA_NUMBER, UART5_TX_DMA_STREAM)
#    define UART5_TX_DMA_IRQHandler                                             \
      CSP_DMA_STREAM_IRQ(UART5_TX_DMA_NUMBER, UART5_TX_DMA_STREAM)
#  endif /* UART5_TX_DMA */

#endif /* UART5_ENABLE */

/**
 * @}
 */

/*****************************************************************************
 * @defgroup USART6 Functions
 * @{
 */

#if USART6_ENABLE

#if (USART6_TX_ID == 0)
#elif (USART6_TX_ID == 1)
#  define USART6_TX_AF GPIO_AF8_USART6
#  if (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F446xx) || defined(STM32F405xx))
#    error "PA11 can not be configured as USART6 TX on STM32F407xx, STM32F439xx, STM32F429xx, STM32F479xx, STM32F415xx, STM32F469xx, STM32F437xx, STM32F427xx, STM32F417xx, STM32F446xx, STM32F405xx! "
#  endif  /* (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F446xx) || defined(STM32F405xx)) */
#elif (USART6_TX_ID == 2)
#  define USART6_TX_AF GPIO_AF8_USART6
#elif (USART6_TX_ID == 3)
#  define USART6_TX_AF GPIO_AF8_USART6
#  if (defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC))
#    error "PG14 can not be configured as USART6 TX on STM32F401xE, STM32F411xE, STM32F410Cx, STM32F410Rx, STM32F410Tx, STM32F401xC! "
#  endif  /* (defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC)) */
#endif  /* USART6_TX_ID */

#if (USART6_RX_ID == 0)
#elif (USART6_RX_ID == 1)
#  define USART6_RX_AF GPIO_AF8_USART6
#  if (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F446xx) || defined(STM32F405xx))
#    error "PA12 can not be configured as USART6 RX on STM32F407xx, STM32F439xx, STM32F429xx, STM32F479xx, STM32F415xx, STM32F469xx, STM32F437xx, STM32F427xx, STM32F417xx, STM32F446xx, STM32F405xx! "
#  endif  /* (defined(STM32F407xx) || defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F415xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F427xx) || defined(STM32F417xx) || defined(STM32F446xx) || defined(STM32F405xx)) */
#elif (USART6_RX_ID == 2)
#  define USART6_RX_AF GPIO_AF8_USART6
#elif (USART6_RX_ID == 3)
#  define USART6_RX_AF GPIO_AF8_USART6
#  if (defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC))
#    error "PG9 can not be configured as USART6 RX on STM32F401xE, STM32F411xE, STM32F410Cx, STM32F410Rx, STM32F410Tx, STM32F401xC! "
#  endif  /* (defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC)) */
#endif  /* USART6_RX_ID */

