shanlingjiangjie/damiao4310_driver/step1_run/Drivers/CSP/UART_STM32F4xx.h
#if (USART6_CTS_ID == 0)
#elif (USART6_CTS_ID == 1)
#  define USART6_CTS_AF GPIO_AF8_USART6
#  if (defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC))
#    error "PG13 can not be configured as USART6 CTS on STM32F401xE, STM32F411xE, STM32F410Cx, STM32F410Rx, STM32F410Tx, STM32F401xC! "
#  endif  /* (defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC)) */
#elif (USART6_CTS_ID == 2)
#  define USART6_CTS_AF GPIO_AF8_USART6
#  if (defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC))
#    error "PG15 can not be configured as USART6 CTS on STM32F401xE, STM32F411xE, STM32F410Cx, STM32F410Rx, STM32F410Tx, STM32F401xC! "
#  endif  /* (defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC)) */
#endif  /* USART6_CTS_ID */

#if (USART6_RTS_ID == 0)
#elif (USART6_RTS_ID == 1)
#  define USART6_RTS_AF GPIO_AF8_USART6
#  if (defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC))
#    error "PG8 can not be configured as USART6 RTS on STM32F401xE, STM32F411xE, STM32F410Cx, STM32F410Rx, STM32F410Tx, STM32F401xC! "
#  endif  /* (defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC)) */
#elif (USART6_RTS_ID == 2)
#  define USART6_RTS_AF GPIO_AF8_USART6
#  if (defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC))
#    error "PG12 can not be configured as USART6 RTS on STM32F401xE, STM32F411xE, STM32F410Cx, STM32F410Rx, STM32F410Tx, STM32F401xC! "
#  endif  /* (defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F410Tx) || defined(STM32F401xC)) */
#endif  /* USART6_RTS_ID */

extern UART_HandleTypeDef usart6_handle;

uint8_t usart6_init(uint32_t baud_rate);
uint8_t usart6_deinit(void); 

#  if USART6_RX_DMA
#    define USART6_RX_DMA_IRQn                                                  \
      CSP_DMA_STREAM_IRQn(USART6_RX_DMA_NUMBER, USART6_RX_DMA_STREAM)
#    define USART6_RX_DMA_IRQHandler                                             \
      CSP_DMA_STREAM_IRQ(USART6_RX_DMA_NUMBER, USART6_RX_DMA_STREAM)
#  endif /* USART6_RX_DMA */

#  if USART6_TX_DMA
#    define USART6_TX_DMA_IRQn                                                  \
      CSP_DMA_STREAM_IRQn(USART6_TX_DMA_NUMBER, USART6_TX_DMA_STREAM)
#    define USART6_TX_DMA_IRQHandler                                             \
      CSP_DMA_STREAM_IRQ(USART6_TX_DMA_NUMBER, USART6_TX_DMA_STREAM)
#  endif /* USART6_TX_DMA */

#endif /* USART6_ENABLE */

/**
 * @}
 */

/*****************************************************************************
 * @defgroup UART7 Functions
 * @{
 */

#if UART7_ENABLE

#if (UART7_TX_ID == 0)
#elif (UART7_TX_ID == 1)
#  define UART7_TX_AF GPIO_AF8_UART7
#  if (defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F427xx))
#    error "PA15 can not be configured as UART7 TX on STM32F439xx, STM32F429xx, STM32F479xx, STM32F469xx, STM32F437xx, STM32F427xx! "
#  endif  /* (defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F427xx)) */
#elif (UART7_TX_ID == 2)
#  define UART7_TX_AF GPIO_AF8_UART7
#  if (defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F427xx))
#    error "PB4 can not be configured as UART7 TX on STM32F439xx, STM32F429xx, STM32F479xx, STM32F469xx, STM32F437xx, STM32F427xx! "
#  endif  /* (defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F427xx)) */
#endif  /* UART7_TX_ID */

#if (UART7_RX_ID == 0)
#elif (UART7_RX_ID == 1)
#  define UART7_RX_AF GPIO_AF8_UART7
#  if (defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F427xx))
#    error "PA8 can not be configured as UART7 RX on STM32F439xx, STM32F429xx, STM32F479xx, STM32F469xx, STM32F437xx, STM32F427xx! "
#  endif  /* (defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F427xx)) */
#elif (UART7_RX_ID == 2)
#  define UART7_RX_AF GPIO_AF8_UART7
#  if (defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F427xx))
#    error "PB3 can not be configured as UART7 RX on STM32F439xx, STM32F429xx, STM32F479xx, STM32F469xx, STM32F437xx, STM32F427xx! "
#  endif  /* (defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F427xx)) */
#endif  /* UART7_RX_ID */

extern UART_HandleTypeDef uart7_handle;

uint8_t uart7_init(uint32_t baud_rate);
uint8_t uart7_deinit(void); 

#  if UART7_RX_DMA
#    define UART7_RX_DMA_IRQn                                                  \
      CSP_DMA_STREAM_IRQn(UART7_RX_DMA_NUMBER, UART7_RX_DMA_STREAM)
#    define UART7_RX_DMA_IRQHandler                                             \
      CSP_DMA_STREAM_IRQ(UART7_RX_DMA_NUMBER, UART7_RX_DMA_STREAM)
#  endif /* UART7_RX_DMA */

#  if UART7_TX_DMA
#    define UART7_TX_DMA_IRQn                                                  \
      CSP_DMA_STREAM_IRQn(UART7_TX_DMA_NUMBER, UART7_TX_DMA_STREAM)
#    define UART7_TX_DMA_IRQHandler                                             \
      CSP_DMA_STREAM_IRQ(UART7_TX_DMA_NUMBER, UART7_TX_DMA_STREAM)
#  endif /* UART7_TX_DMA */

#endif /* UART7_ENABLE */

/**
 * @}
 */

/*****************************************************************************
 * @defgroup UART8 Functions
 * @{
 */

#if UART8_ENABLE

#if (UART8_TX_ID == 0)
#elif (UART8_TX_ID == 1)
#  define UART8_TX_AF GPIO_AF8_UART8
#  if (defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F427xx))
#    error "PF9 can not be configured as UART8 TX on STM32F439xx, STM32F429xx, STM32F479xx, STM32F469xx, STM32F437xx, STM32F427xx! "
#  endif  /* (defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F427xx)) */
#endif  /* UART8_TX_ID */

#if (UART8_RX_ID == 0)
#elif (UART8_RX_ID == 1)
#  define UART8_RX_AF GPIO_AF8_UART8
#  if (defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F427xx))
#    error "PF8 can not be configured as UART8 RX on STM32F439xx, STM32F429xx, STM32F479xx, STM32F469xx, STM32F437xx, STM32F427xx! "
#  endif  /* (defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F427xx)) */
#endif  /* UART8_RX_ID */

extern UART_HandleTypeDef uart8_handle;

uint8_t uart8_init(uint32_t baud_rate);
uint8_t uart8_deinit(void); 

