shanlingjiangjie/damiao4310_driver/step1_run/Drivers/CSP/UART_STM32F4xx.h
#  if UART8_RX_DMA
#    if (UART8_RX_DMA_NUMBER == 1) && (UART8_RX_DMA_STREAM == 0) && (UART8_RX_DMA_CHANNEL == 5)

#     if (defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F427xx))
#       error "This UART8 DMA RX configuration invalid on STM32F439xx, STM32F429xx, STM32F479xx, STM32F469xx, STM32F437xx, STM32F427xx! "
#     endif  /* (defined(STM32F439xx) || defined(STM32F429xx) || defined(STM32F479xx) || defined(STM32F469xx) || defined(STM32F437xx) || defined(STM32F427xx)) */
#    endif /* (UART8_RX_DMA_NUMBER == 1) && (UART8_RX_DMA_STREAM == 0) && (UART8_RX_DMA_CHANNEL == 5) */

#    define UART8_RX_DMA_IRQn                                                  \
      CSP_DMA_STREAM_IRQn(UART8_RX_DMA_NUMBER, UART8_RX_DMA_STREAM)
#    define UART8_RX_DMA_IRQHandler                                             \
      CSP_DMA_STREAM_IRQ(UART8_RX_DMA_NUMBER, UART8_RX_DMA_STREAM)
#  endif /* UART8_RX_DMA */

#  if UART8_TX_DMA
#    if (UART8_TX_DMA_NUMBER == 1) && (UART8_TX_DMA_STREAM == 0) && (UART8_TX_DMA_CHANNEL == 5)

#     if (defined(STM32F423xx) || defined(STM32F413xx))
#       error "This UART8 DMA TX configuration invalid on STM32F423xx, STM32F413xx! "
#     endif  /* (defined(STM32F423xx) || defined(STM32F413xx)) */
#    endif /* (UART8_TX_DMA_NUMBER == 1) && (UART8_TX_DMA_STREAM == 0) && (UART8_TX_DMA_CHANNEL == 5) */

#    define UART8_TX_DMA_IRQn                                                  \
      CSP_DMA_STREAM_IRQn(UART8_TX_DMA_NUMBER, UART8_TX_DMA_STREAM)
#    define UART8_TX_DMA_IRQHandler                                             \
      CSP_DMA_STREAM_IRQ(UART8_TX_DMA_NUMBER, UART8_TX_DMA_STREAM)
#  endif /* UART8_TX_DMA */

#endif /* UART8_ENABLE */

/**
 * @}
 */

/*****************************************************************************
 * @defgroup UART9 Functions
 * @{
 */

#if UART9_ENABLE

#if (UART9_TX_ID == 0)
#elif (UART9_TX_ID == 1)
#  define UART9_TX_AF GPIO_AF11_UART9
#elif (UART9_TX_ID == 2)
#  define UART9_TX_AF GPIO_AF11_UART9
#endif  /* UART9_TX_ID */

#if (UART9_RX_ID == 0)
#elif (UART9_RX_ID == 1)
#  define UART9_RX_AF GPIO_AF11_UART9
#elif (UART9_RX_ID == 2)
#  define UART9_RX_AF GPIO_AF11_UART9
#endif  /* UART9_RX_ID */

extern UART_HandleTypeDef uart9_handle;

uint8_t uart9_init(uint32_t baud_rate);
uint8_t uart9_deinit(void); 

#  if UART9_RX_DMA
#    define UART9_RX_DMA_IRQn                                                  \
      CSP_DMA_STREAM_IRQn(UART9_RX_DMA_NUMBER, UART9_RX_DMA_STREAM)
#    define UART9_RX_DMA_IRQHandler                                             \
      CSP_DMA_STREAM_IRQ(UART9_RX_DMA_NUMBER, UART9_RX_DMA_STREAM)
#  endif /* UART9_RX_DMA */

#  if UART9_TX_DMA
#    define UART9_TX_DMA_IRQn                                                  \
      CSP_DMA_STREAM_IRQn(UART9_TX_DMA_NUMBER, UART9_TX_DMA_STREAM)
#    define UART9_TX_DMA_IRQHandler                                             \
      CSP_DMA_STREAM_IRQ(UART9_TX_DMA_NUMBER, UART9_TX_DMA_STREAM)
#  endif /* UART9_TX_DMA */

#endif /* UART9_ENABLE */

/**
 * @}
 */

/*****************************************************************************
 * @defgroup UART10 Functions
 * @{
 */

#if UART10_ENABLE

#if (UART10_TX_ID == 0)
#elif (UART10_TX_ID == 1)
#  define UART10_TX_AF GPIO_AF11_UART10
#elif (UART10_TX_ID == 2)
#  define UART10_TX_AF GPIO_AF11_UART10
#endif  /* UART10_TX_ID */

#if (UART10_RX_ID == 0)
#elif (UART10_RX_ID == 1)
#  define UART10_RX_AF GPIO_AF11_UART10
#elif (UART10_RX_ID == 2)
#  define UART10_RX_AF GPIO_AF11_UART10
#endif  /* UART10_RX_ID */

extern UART_HandleTypeDef uart10_handle;

uint8_t uart10_init(uint32_t baud_rate);
uint8_t uart10_deinit(void); 

#  if UART10_RX_DMA
#    define UART10_RX_DMA_IRQn                                                  \
      CSP_DMA_STREAM_IRQn(UART10_RX_DMA_NUMBER, UART10_RX_DMA_STREAM)
#    define UART10_RX_DMA_IRQHandler                                             \
      CSP_DMA_STREAM_IRQ(UART10_RX_DMA_NUMBER, UART10_RX_DMA_STREAM)
#  endif /* UART10_RX_DMA */

#  if UART10_TX_DMA
#    define UART10_TX_DMA_IRQn                                                  \
      CSP_DMA_STREAM_IRQn(UART10_TX_DMA_NUMBER, UART10_TX_DMA_STREAM)
#    define UART10_TX_DMA_IRQHandler                                             \
      CSP_DMA_STREAM_IRQ(UART10_TX_DMA_NUMBER, UART10_TX_DMA_STREAM)
#  endif /* UART10_TX_DMA */

#endif /* UART10_ENABLE */

/**
 * @}
 */


/* clang-format on */

/*****************************************************************************
 * @defgroup Public uart function.
 * @{
 */

int uart_printf(UART_HandleTypeDef *huart, const char *__format, ...);
int uart_scanf(UART_HandleTypeDef *huart, const char *__format, ...);

uint32_t uart_dmarx_read(UART_HandleTypeDef *huart, void *buf, size_t len);
uint8_t uart_dmarx_resize_fifo(UART_HandleTypeDef *huart, uint32_t buf_size,
                               uint32_t fifo_size);
uint32_t uart_dmarx_get_buf_size(UART_HandleTypeDef *huart);
uint32_t uart_dmarx_get_fifo_size(UART_HandleTypeDef *huart);

uint32_t uart_dmatx_write(UART_HandleTypeDef *huart, const void *data,
                          size_t len);
uint32_t uart_dmatx_send(UART_HandleTypeDef *huart);
uint8_t uart_dmatx_resize_buf(UART_HandleTypeDef *huart, uint32_t size);
uint32_t uart_damtx_get_buf_szie(UART_HandleTypeDef *huart);

/**
 * @}
 */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* __UART_STM32F4xx_H */
